In [1]:
try:
    import tabulate
    from tabulate import tabulate


except:
    !pip install tabulate
    import tabulate

In [2]:
from shutil import which
import sqlite3

In [3]:
banco = sqlite3.connect("Tarefa SQL.db")
cursor = banco.cursor()

In [4]:
# Criando uma tabela 'departamentos' com as campos idDepartamento, nomeDepartamento
cursor.execute("CREATE TABLE departamentos (idDepartamento integer PRIMARY KEY , nomeDepartamento text)")
print("Tabela criada com sucesso!")
# Inserindo dados na tabela
# Primeiro criamos uma lista com conteúdo a ser inserido, na mesma ordem dos tipos de dados definidos
listadepartamento = [('1','TI'),
                     ('2','Fisica'),
                     ('3','Matemática'),
                     ('4','Engenharia'),
                     ('5','Biologia'),
                     ('6','História')]

# Inserimos os dados da lista dentro da tabela
cursor.executemany("""INSERT INTO departamentos VALUES (?,?)""", listadepartamento)
print("Dados inseridos com sucesso!")
banco.commit()

Tabela criada com sucesso!
Dados inseridos com sucesso!

In [5]:
# Consulta dados da tabela 'estudantes'
cursor.execute("SELECT * FROM departamentos")
print (tabulate (cursor.fetchall()))

-  ----------
1  TI
2  Fisica
3  Matemática
4  Engenharia
5  Biologia
6  História
-  ----------

In [6]:
cursor.execute("""CREATE TABLE IF NOT EXISTS funcionarios (codigoFUNCIONARIO integer, nomeFUNCIONARIO text, segundonomeFUNCIONARIO text,
ultimonomeFUNCIONARIO text, datanascFUNCIONARIO integer, cpfFUNCIONARIO varchar(11), rgFUNCIONARIO varchar(9), enderecoFUNCIONARIO text, 
cepFUNCIONARIO varchar(8), cidadeFUNCIONARIO text, foneFUNCIONARIO integer, idDepartamento integer, funcaoFUNCIONARIO text, salarioFUNCIONARIO real) """)

banco.commit()

In [7]:
lista = [('1', 'Felipe', 'Lopes', 'Pontes', '10/11/1999', '000.000.000-00', '00.000000-0', 'Rua logo ali', '00000-000', 'Itapetininga', '000000000', '3', 'Desenvolvedor', '4.5000,00'),
         ('2', 'Lucas', 'Sousa', 'Pinto', '07/01/1994', '000.000.000-01', '00.000000-1',
          'Rua quase pereto', '00000-001', 'Itapetininga', '000000001', '2', 'Pintor', '2.5000,00'),
         ('3', 'Paulo', 'Henrique', 'Garcia', '02/12/1992', '000.000.000-02', '00.000000-2',
          'Rua vish', '00000-002', 'Itapetininga', '000000002', '1', 'Estioquista', '1.5000,00'),
         ('4', 'Dominic', 'Lenz', 'Phins', '21/01/1993', '000.000.000-03', '00.000000-3',
          'Rua pertinho', '00000-003', 'Itapetininga', '000000003', '4', 'Motorista', '2.0000,00'),
         ('5', 'Bruno', 'Lopes', 'Pontes', '01/05/1999', '000.000.000-04', '00.000000-4',
          'Rua logo ali', '00000-004', 'Itapetininga', '000000004', '3', 'RH', '3.5000,00'),
         ('7', 'Elias', 'Sousa', 'Pontes', '18/07/1973', '000.000.000-05', '00.000000-5',
          'Rua perto', '00000-005', 'Itapetininga', '000000005', '2', 'Porteiro', '2.0000,00'),
         ('8', 'Carlos', 'Maciel', 'Silva', '15/06/1998', '000.000.000-08', '00.000000-8',
          'Rua logo ', '00000-008', 'Itapetininga', '000000008', '1', 'Auxiliar', '1.5000,00'),
         ('9', 'Thiago', 'Sarnei', 'Moura', '18/07/1991', '000.000.000-09', '00.000000-9',
          'Rua ali', '00000-009', 'Itapetininga', '000000009', '3', 'Motoboy', '2.0000,00'),
         ('10', 'Maria', 'Silva', 'Vieira', '19/11/1994', '000.000.000-10', '00.000001-0',
          'Rua quase', '00000-010', 'Itapetininga', '000000010', '3', 'Empregada', '1.9000,00'),
         ('11', 'Lira', 'Luns', 'Live', '05/10/1989', '000.000.002-00', '00.000002-0',
          'Rua deixa', '00000-020', 'Itapetininga', '000000020', '1', 'Gerente', '4.5000,00'),
         ('12', 'Odin', 'Lopes', 'Handal', '08/10/1999', '000.000.000-00', '00.000000-0', 'Rua logo ali', '00000-000', 'Itapetininga', '000000000', '3', 'Desenvolvedor', '4.5000,00')]

In [8]:

cursor.executemany(
    """INSERT INTO funcionarios VALUES(?,?,?,?,?,?,?,?,?,?,?,?,?,?)""", lista)

banco.commit()
print("Dados inseridos!")

Dados inseridos!

In [ ]:
# Consulta dados da tabela 'estudantes'
cursor.execute("SELECT * FROM funcionarios")
print (tabulate (cursor.fetchall()))

In [10]:
# A)	Listar nome e sobrenome ordenado por sobrenome
sql = """SELECT
  funcionarios.nomeFUNCIONARIO,
  funcionarios.ultimonomeFUNCIONARIO
  FROM funcionarios
order by ultimonomeFUNCIONARIO """

cursor.execute(sql)
print (tabulate (cursor.fetchall()))

-------  ------
Paulo    Garcia
Odin     Handal
Lira     Live
Thiago   Moura
Dominic  Phins
Lucas    Pinto
Felipe   Pontes
Bruno    Pontes
Elias    Pontes
Carlos   Silva
Maria    Vieira
-------  ------

In [11]:
#B)	Listar todos os campos de funcionários ordenados por cidade
sql = """SELECT *

  FROM funcionarios
order by cidadeFUNCIONARIO """

cursor.execute(sql)
print (tabulate (cursor.fetchall()))

--  -------  --------  ------  ----------  --------------  -----------  ----------------  ---------  ------------  --  -  -------------  ---------
 1  Felipe   Lopes     Pontes  10/11/1999  000.000.000-00  00.000000-0  Rua logo ali      00000-000  Itapetininga   0  3  Desenvolvedor  4.5000,00
 2  Lucas    Sousa     Pinto   07/01/1994  000.000.000-01  00.000000-1  Rua quase pereto  00000-001  Itapetininga   1  2  Pintor         2.5000,00
 3  Paulo    Henrique  Garcia  02/12/1992  000.000.000-02  00.000000-2  Rua vish          00000-002  Itapetininga   2  1  Estioquista    1.5000,00
 4  Dominic  Lenz      Phins   21/01/1993  000.000.000-03  00.000000-3  Rua pertinho      00000-003  Itapetininga   3  4  Motorista      2.0000,00
 5  Bruno    Lopes     Pontes  01/05/1999  000.000.000-04  00.000000-4  Rua logo ali      00000-004  Itapetininga   4  3  RH             3.5000,00
 7  Elias    Sousa     Pontes  18/07/1973  000.000.000-05  00.000000-5  Rua perto         00000-005  Itapetininga   5  2  Porteiro       2.0000,00
 8  Carlos   Maciel    Silva   15/06/1998  000.000.000-08  00.000000-8  Rua logo          00000-008  Itapetininga   8  1  Auxiliar       1.5000,00
 9  Thiago   Sarnei    Moura   18/07/1991  000.000.000-09  00.000000-9  Rua ali           00000-009  Itapetininga   9  3  Motoboy        2.0000,00
10  Maria    Silva     Vieira  19/11/1994  000.000.000-10  00.000001-0  Rua quase         00000-010  Itapetininga  10  3  Empregada      1.9000,00
11  Lira     Luns      Live    05/10/1989  000.000.002-00  00.000002-0  Rua deixa         00000-020  Itapetininga  20  1  Gerente        4.5000,00
12  Odin     Lopes     Handal  08/10/1999  000.000.000-00  00.000000-0  Rua logo ali      00000-000  Itapetininga   0  3  Desenvolvedor  4.5000,00
--  -------  --------  ------  ----------  --------------  -----------  ----------------  ---------  ------------  --  -  -------------  ---------

In [25]:
#C)	Liste os funcionários que têm salário superior a R$ 1.000,00 ordenados pelo nome completo

cursor.execute("SELECT nomeFUNCIONARIO,ultimonomeFUNCIONARIO,salarioFUNCIONARIO FROM funcionarios   where salarioFUNCIONARIO > 1000 order by nomeFUNCIONARIO ")
print (tabulate (cursor.fetchall()))

-------  ------  ---------
Bruno    Pontes  3.5000,00
Carlos   Silva   1.5000,00
Dominic  Phins   2.0000,00
Elias    Pontes  2.0000,00
Felipe   Pontes  4.5000,00
Lira     Live    4.5000,00
Lucas    Pinto   2.5000,00
Maria    Vieira  1.9000,00
Odin     Handal  4.5000,00
Paulo    Garcia  1.5000,00
Thiago   Moura   2.0000,00
-------  ------  ---------

In [ ]:
#D)	Liste a data de nascimento e o primeiro nome dos funcionários ordenados do mais novo para o mais velho
#
sql = """SELECT
  funcionarios.nomeFUNCIONARIO,
  departamentos.nomeDepartamento,
  funcionarios.funcaoFUNCIONARIO
FROM departamentos
INNER JOIN funcionarios ON funcionarios.idDepartamento = departamentos.idDepartamento"""

cursor.execute(sql)
print (tabulate (cursor.fetchall()))

In [27]:
#E)	Liste o total da folha de pagamento

sql = """SELECT sum(salarioFUNCIONARIO)
FROM funcionarios
"""

cursor.execute(sql)
print (tabulate (cursor.fetchall()))

----
30.4
----

In [30]:
#F)	Liste o nome, o nome do departamento e a função de todos os funcionários
#
sql = """SELECT
  funcionarios.nomeFUNCIONARIO,
  departamentos.nomeDepartamento,
  funcionarios.funcaoFUNCIONARIO
FROM departamentos
INNER JOIN funcionarios ON funcionarios.idDepartamento = departamentos.idDepartamento"""

cursor.execute(sql)
print (tabulate (cursor.fetchall()))

-------  ----------  -------------
Felipe   Matemática  Desenvolvedor
Lucas    Fisica      Pintor
Paulo    TI          Estioquista
Dominic  Engenharia  Motorista
Bruno    Matemática  RH
Elias    Fisica      Porteiro
Carlos   TI          Auxiliar
Thiago   Matemática  Motoboy
Maria    Matemática  Empregada
Lira     TI          Gerente
Odin     Matemática  Desenvolvedor
-------  ----------  -------------

In [29]:
#G)	Liste a quantidade de funcionários desta empresa
sql = """SELECT count(nomeFUNCIONARIO)
FROM funcionarios
"""

cursor.execute(sql)
print (tabulate (cursor.fetchall()))

--
11
--

In [34]:
#H)	Liste o nome do departamento e do funcionário ordenados por departamento e funcionário
sql = """SELECT
  departamentos.nomeDepartamento,
  funcionarios.nomeFUNCIONARIO
FROM departamentos
INNER JOIN funcionarios ON funcionarios.idDepartamento = departamentos.idDepartamento order by departamentos.nomeDepartamento,  funcionarios.nomeFUNCIONARIO """

cursor.execute(sql)
print (tabulate (cursor.fetchall()))

----------  -------
Engenharia  Dominic
Fisica      Elias
Fisica      Lucas
Matemática  Bruno
Matemática  Felipe
Matemática  Maria
Matemática  Odin
Matemática  Thiago
TI          Carlos
TI          Lira
TI          Paulo
----------  -------